--- 
layout: post
status: publish
type: post
published: true
title: "初到温哥华"
---
15日下午4点，国航的飞机从北京起飞。除了中间的不超过3个小时的准黑夜，飞机一直飞行在白天。这让第一次做长途飞行的我多少感到奇怪。到达温哥华是当地时间15日上午11点，北京时间16日凌晨3点。不知不觉间，竟然同时过着两天的生活。

飞机上迷迷糊糊的在北京时间晚上9点睡了，然后在温哥华时间9点半醒来，骗着自己的大脑和身体说，嗯，你已经睡了十二个小时了。然而身体显然与这种简单的把戏在作对：有点头晕。

飞机上跟邻座聊天，寒暄过后，她跟我说的第一句话居然是：你可以留在加拿大不回来，大约一年后以难民身份申请一张枫叶卡（大概是永久居留证之类）。“那岂不要放弃中国国籍吗？”我问。“不用，”她很随意地说，“我们那里的人都是这么做的。几乎每家都有偷渡去国外的，现在当地只剩下老人和小孩了。”我记起前几年北京的一位同事好像跟我说过类似的情况，我只是笑笑，以为只是个人偶尔行为——给组织偷渡的人交几十万，想办法到美国——没想到居然这么流行了。问了问她的情况，在北美餐馆打工，每天工作十几个小时，每周有一天休息，一个月下来大约能拿到2000多块（美金），确实比在国内要挣得多。跟她又聊起房价，做事的难度，基本上这些原因都使得像她那样的人，甚至即便已经攒了二三十万（二三百万人民币呢）都不愿意回来。我想说现在是中国的经济发展期，但这个话题太深，她是否能理解不谈，我是无法驾驭的；更何况对于那样的收入，很多国内做IT的人都会很不忿。“中国不仅劳力便宜，脑力也便宜”，常住加拿大的朋友Sue这样说。

离温哥华还有20分钟时，飞机开始下降，从云层上到云层下。云很干净，很厚实，像小时候准备收割的新棉花，洁白，松软，于是我忍不住拍了几张照片。机翼和窗户影响了拍摄效果，但大致能看出来那种密度和质感。飞得低了，开始看见大海。看来这是温哥华的港口，飞得更低的时候看见许多船从不同方向向着不同方向行驶；海面波光粼粼，很是漂亮。正看着，飞机越过机场的围墙，机身轻轻一震，已经落在了温哥华机场的跑道上了。

除了飞机，有警察很耐心的问好“How are you today”，然后问你此行的目的，过了这一关，进入大楼，迎面而来的是一个巨大的标志，我不知道这些标志的含义；右边是一艘小船，乍一看还以为是进了公园。广告所说“温哥华机场是北美No.1”，名不虚传，宽敞，明亮，轻松，方便。主要是人少，走着走着，比起首都国际机场的人流量简直小巫见大巫，甚至比不上西安咸阳国际机场。忽然记起由一位北美的同事，家庭电话号码才5位，想想真是有趣。

由于时间有限，下午2:25需要转机去西北部Alberta省的Calgary，我打消去市中心逛的念头。用中国联通的IP卡给Calgary的同事打了电话，200元的电话卡居然只能讲28分钟，真是……中午在机场里吃了汉堡和可乐，$8.5，合人民币约60块，这也算我一个人吃饭的最高纪录了。

PS. 其实我是一个很后知后觉的人，以至于我期待的那种惊喜感并没有如期而至——也许几天后或者几个月以后的某天会有感觉。温哥华一如其他打城市，眼花缭乱的广告，高高的建筑，同样陌生的人们。不同的是语言，以及不像北京那样的拥挤。以前我曾说，所有的大城市都差不多的。现在逐渐改变了看法——所有的大城市看上去都差不多，然而要理解并融入一个城市，需要与他息息的生活在一起。这种投入，我不一定有机会，就算有机会，也不一定有时间。
